import React from "react";

function Courses() {
  return (
    <div>
      <div className="card">
        <img
          src="https://cdn.tuwaiq.edu.sa/initiatives_admin/images/bdp2dbpf.alb.webp"
          alt=""
        />

        <h3>تصميم تجربة المستخدم UX\UI</h3>
        <p>
          يهدف المعسكر إلى تمكين المشاركين من فهم المفاهيم الأساسية لتصميم
          واجهات وتجربة المستخدم، بما في ذلك إجراء أبحاث المستخدم وتحليل
          احتياجاته باستخدام منهجية التصميم المتمركز حول الإنسان (User-Centric
          Design) ومنهجية التفكير التصميمي (Design Thinking)، سيكتسب المشاركون
          مهارات تصميم حلول إبداعية لتحسين تجربة المستخدم وبناء واجهات احترافية
          باستخدام أدوات التصميم الإحترافية مثل Figma.
        </p>
        <h3>المدة:</h3>
        <p>٦ أسابيع</p>
      </div>
      <div className="card">
        <img
          src="https://cdn.tuwaiq.edu.sa/initiatives_admin/images/0tzrcgd5.bxe.webp"
          alt=""
        />

        <h3>بناء وتطوير نماذج الذكاء الاصطناعي</h3>
        <p>
          يهدف المعسكر إلى تعريف المشاركين بالمفاهيم الشاملة والمتقدمة المتعلقة
          بعلم الذكاء الاصطناعي، مع التركيز على بناء أساس قوي في مجالات تعلم
          الآلة والتعلم العميق باستخدام لغة Python، سيكتسب المشاركون خلال
          المعسكر فهمًا عميقًا لطرق استخدام البيانات بشكل فعال لتدريب النماذج
          وتحسينها وتقييم كفاءتها، مع التركيز على تطبيقات عملية في مجالات متنوعة
          مثل رؤية الحاسوب ومعالجة اللغات الطبيعية.
        </p>
        <h3>المدة:</h3>
        <p>٦ أسابيع</p>
      </div>
      <div className="card">
        <img
          src="https://cdn.tuwaiq.edu.sa/initiatives_admin/images/zee1ko3s.2mb.webp"
          alt=""
        />

        <h3>مركز عمليات الأمن - المستوى الأول</h3>
        <p>
          يهدف المعسكر إلى تزويد الطلاب بالمعرفة الأساسية والمهارات العملية
          اللازمة للنجاح في وظائف محلل أمن معلومات (SOC) من المستوى الأول أو
          الثاني، من خلال استكشاف مواضيع رئيسية مثل تحليل هجمات التصيد
          الاحتيالي، إجراءات الاستجابة للحوادث، طرق اكتشاف التهديدات، مراجعة
          السجلات، تشغيل نظام SIEM، واستخدام أدوات الأمان، سيكتسب الطلاب
          المهارات الأساسية المطلوبة لمراقبة الحوادث الأمنية والتحقيق فيها
          ومعالجتها في بيئة SOC
        </p>
        <h3>المدة:</h3>
        <p>٦ أسابيع</p>
      </div>
    </div>
  );
}

export default Courses;
